In [64]:
# Q1. List any five functions of the pandas library with execution.

In [65]:
import pandas as pd

1=df.head()
2=df.tail()
3=df.shape
4=df.info()
5=df.isna().sum()

In [66]:
df1=pd.read_csv('services.csv')

In [67]:
df1.head()

,id,location_id,program_id,accepted_payments,alternate_name,application_process,audience,description,eligibility,email,...,interpretation_services,keywords,languages,name,required_documents,service_areas,status,wait_time,website,taxonomy_ids
0,1,1,NaN,NaN,NaN,Walk in or apply by phone.,"Older adults age 55 or over, ethnic minorities...",A walk-in center for older adults that provide...,"Age 55 or over for most programs, age 60 or ov...",NaN,...,NaN,"ADULT PROTECTION AND CARE SERVICES, Meal Sites...",NaN,Fair Oaks Adult Activity Center,NaN,Colma,active,No wait.,NaN,NaN
1,2,2,NaN,NaN,NaN,Apply by phone for an appointment.,Residents of San Mateo County age 55 or over,Provides training and job placement to eligibl...,"Age 55 or over, county resident and willing an...",NaN,...,NaN,"EMPLOYMENT/TRAINING SERVICES, Job Development,...",NaN,Second Career Employment Program,NaN,San Mateo County,active,Varies.,NaN,NaN
2,3,3,NaN,NaN,NaN,Phone for information (403-4300 Ext. 4322).,Older adults age 55 or over who can benefit fr...,Offers supportive counseling services to San M...,Resident of San Mateo County age 55 or over,NaN,...,NaN,"Geriatric Counseling, Older Adults, Gay, Lesbi...",NaN,Senior Peer Counseling,NaN,San Mateo County,active,Varies.,NaN,NaN
3,4,4,NaN,NaN,NaN,Apply by phone.,"Parents, children, families with problems of c...",Provides supervised visitation services and a ...,None,NaN,...,NaN,"INDIVIDUAL AND FAMILY DEVELOPMENT SERVICES, Gr...",NaN,Family Visitation Center,NaN,San Mateo County,active,No wait.,NaN,NaN
4,5,5,NaN,NaN,NaN,Phone for information.,Low-income working families with children tran...,Provides fixed 8% short term loans to eligible...,Eligibility: Low-income family with legal cust...,NaN,...,NaN,"COMMUNITY SERVICES, Speakers, Automobile Loans",NaN,Economic Self-Sufficiency Program,NaN,San Mateo County,active,NaN,NaN,NaN

In [68]:
df1.tail()

,id,location_id,program_id,accepted_payments,alternate_name,application_process,audience,description,eligibility,email,...,interpretation_services,keywords,languages,name,required_documents,service_areas,status,wait_time,website,taxonomy_ids
18,19,19,NaN,NaN,NaN,Call for screening appointment (650-347-3648).,NaN,Provides free medical and dental care to those...,Low-income person without access to health care,NaN,...,NaN,"HEALTH SERVICES, Outpatient Care, Community Cl...",NaN,San Mateo Free Medical Clinic,NaN,"Belmont, Burlingame",active,Varies.,NaN,NaN
19,20,20,NaN,NaN,NaN,Walk in.,NaN,no unrequired fields for this service,NaN,NaN,...,NaN,NaN,NaN,Service with blank fields,NaN,NaN,defunct,NaN,NaN,NaN
20,21,21,NaN,NaN,NaN,By phone during business hours.,NaN,just a test service,NaN,NaN,...,NaN,NaN,NaN,Service for Admin Test Location,NaN,San Mateo County,inactive,NaN,NaN,NaN
21,22,22,NaN,"Cash, Check, Credit Card",Fotos para pasaportes,Walk in or apply by phone or mail,"Profit and nonprofit businesses, the public, m...",[NOTE THIS IS NOT A REAL SERVICE--THIS IS FOR ...,None,passports@example.org,...,We offer 3-way interpretation services over th...,"Salud, Medicina",Spanish,Passport Photos,Government-issued picture identification,"Alameda County, San Mateo County",active,No wait to 2 weeks.,http://www.example.com,"105, 108, 108-05, 108-05-01, 111, 111-05"
22,23,22,NaN,NaN,NaN,Walk in or apply by phone or mail,"Second service and nonprofit businesses, the p...",[NOTE THIS IS NOT A REAL ORGANIZATION--THIS IS...,None,NaN,...,NaN,"Ruby on Rails/Postgres/Redis, testing, wic",NaN,Example Service Name,NaN,"San Mateo County, Alameda County",active,No wait to 2 weeks,http://www.example.com,NaN

In [69]:
df1.shape

(23, 22)

In [70]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 23 entries, 0 to 22
Data columns (total 22 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   id                       23 non-null     int64
 1   location_id              23 non-null     int64
 2   program_id               0 non-null      float64
 3   accepted_payments        1 non-null      object
 4   alternate_name           1 non-null      object
 5   application_process      23 non-null     object
 6   audience                 14 non-null     object
 7   description              23 non-null     object
 8   eligibility              21 non-null     object
 9   email                    1 non-null      object
 10  fees                     21 non-null     object
 11  funding_sources          21 non-null     object
 12  interpretation_services  1 non-null      object
 13  keywords                 21 non-null     object
 14  languages                1 non-null      object
 15  name                     23 non-null     object
 16  required_documents       1 non-null      object
 17  service_areas            21 non-null     object
 18  status                   23 non-null     object
 19  wait_time                19 non-null     object
 20  website                  2 non-null      object
 21  taxonomy_ids             1 non-null      object
dtypes: float64(1), int64(2), object(19)
memory usage: 4.1+ KB

In [71]:
df1.isna().sum()

id                          0
location_id                 0
program_id                 23
accepted_payments          22
alternate_name             22
application_process         0
audience                    9
description                 0
eligibility                 2
email                      22
fees                        2
funding_sources             2
interpretation_services    22
keywords                    2
languages                  22
name                        0
required_documents         22
service_areas               2
status                      0
wait_time                   4
website                    21
taxonomy_ids               22
dtype: int64

In [72]:
df1.accepted_payments.isna().sum()

22

In [73]:
#  Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the
#      DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [74]:
df=pd.DataFrame({"A":[1,2,3,4],"B":[5,6,7,8],"C":[9,10,11,12]})
df

   A  B   C
0  1  5   9
1  2  6  10
2  3  7  11
3  4  8  12

In [75]:

def reindex_with_custom_index(df):
    
    new_index = range(1, 2 * len(df) + 1, 2)
    
    
    df = df.set_index(pd.Index(new_index))
    
    return df

In [76]:
df = reindex_with_custom_index(df)
print(df)

   A  B   C
1  1  5   9
3  2  6  10
5  3  7  11
7  4  8  12

In [77]:
# Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that
#      iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The
#       function should print the sum to the console.

In [78]:
df = pd.DataFrame({'Values': [10, 20, 30, 40, 50]})
df

   Values
0      10
1      20
2      30
3      40
4      50

In [79]:
def sum_of_first_three_values(df):
    try:
        
        first_three_values = df['Values'].iloc[:3]
             
        total_sum = first_three_values.sum()
            
        print(f"Sum of the first three values: {total_sum}")
    except Exception as e:
        print(f"Error: {e}")

In [80]:
sum_of_first_three_values(df)

Sum of the first three values: 60

In [81]:
# Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column
#     'Word_Count' that contains the number of words in each row of the 'Text' column.

In [82]:
df = pd.DataFrame({'Text': ["This is a sample sentence.", "Another example.", "Just a few words."]})
df

                         Text
0  This is a sample sentence.
1            Another example.
2           Just a few words.

In [83]:
def count_words(df):
    def word_count(text):
        words = text.split()  
        return len(words)   
    df['Word_Count'] = df['Text'].apply(word_count)
    return df

In [84]:
df = count_words(df)
print(df)

                         Text  Word_Count
0  This is a sample sentence.           5
1            Another example.           2
2           Just a few words.           4

In [85]:
# Q5. How are DataFrame.size() and DataFrame.shape() different?

ANS = In Pandas, DataFrame.size and DataFrame.shape are both attributes used to obtain information about the dimensions of a DataFrame, but they serve slightly different purposes:

DataFrame.shape:

DataFrame.shape is an attribute, not a method, so you access it without parentheses.
It returns a tuple representing the dimensions of the DataFrame in the form (number_of_rows, number_of_columns).
For example, if you have a DataFrame df with 100 rows and 5 columns, df.shape would return (100, 5).


DataFrame.size:

DataFrame.size is an attribute that returns the total number of elements in the DataFrame, which is essentially the product of the number of rows and the number of columns.
It is a single integer value representing the size of the DataFrame.
For example, if you have a DataFrame df with 100 rows and 5 columns, df.size would return 500 (100 rows * 5 columns).

EX:-

In [86]:
df1.shape

(23, 22)

In [87]:
df1.size

506

In [88]:
# Q6. Which function of pandas do we use to read an excel file?

ANS= 

In Pandas, you can use the pandas.read_excel() function to read data from an Excel file. This function allows you to read Excel files in various formats, including .xls and .xlsx

In [89]:
df2=pd.read_excel("LUSID Excel - Setting up your market data.xlsx")

In [90]:
df2.head()

,Unnamed: 0,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9
0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,NaN,NaN,NaN,Datetimes in LUSID,NaN,NaN,NaN,NaN,NaN,NaN
2,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,NaN,NaN,NaN,This sheet allows you to format datetimes for...,NaN,NaN,NaN,NaN,NaN,NaN
4,NaN,NaN,NaN,If you have any questions please visit our:,NaN,NaN,NaN,NaN,NaN,NaN

In [91]:
# Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email
#  addresses in the format 'username@domain.com'. Write a Python function that creates a new column
#   'Username' in df that contains only the username part of each email address.

In [92]:
df = pd.DataFrame({'Email': ["user1@example.com", "user2@example.com", "user3@example.com"]})

In [93]:
df

               Email
0  user1@example.com
1  user2@example.com
2  user3@example.com

In [94]:
def extract_username(df):
   
    def get_username(email):
        username = email.split('@')[0] 
        return username

    df['Username'] = df['Email'].apply(get_username)

    return df

In [95]:
df=extract_username(df)
df

               Email Username
0  user1@example.com    user1
1  user2@example.com    user2
2  user3@example.com    user3

In [96]:
# Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects
#all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The
# function should return a new DataFrame that contains only the selected rows.


For example, if df contains the following values:

   A   B   C

0  3   5   1

1  8   2   7

2  6   9   4

3  2   3   5

4  9   1   2

Your function should select the following rows:   A   B   C

1  8   2   7

4  9   1   2

The function should return a new DataFrame that contains only the selected rows.

In [97]:
df=pd.DataFrame({'A': [3, 8, 6, 2, 9],
        'B': [5, 2, 9, 3, 1],
        'C': [1, 7, 4, 5, 2]})

In [98]:
df

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [99]:
def select_rows(df):
    selected_rows = df[(df['A'] > 5) & (df['B'] < 10)]
    return selected_rows

In [100]:
select_rows(df)

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

In [101]:
selected_df = select_rows(df)
print(selected_df)

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

In [102]:
# Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean,
#      median, and standard deviation of the values in the 'Values' column.

In [103]:
df=pd.DataFrame({'values':[1,2,3,4,5]})
df

   values
0       1
1       2
2       3
3       4
4       5

In [104]:
def calculate_statistics(df):
   
    mean = df['values'].mean()
    median = df['values'].median()
    std_dev = df['values'].std()
    
    return mean, median, std_dev

In [105]:
mean, median, std_dev = calculate_statistics(df)

print(f"Mean: {mean}")
print(f"Median: {median}")
print(f"Standard Deviation: {std_dev}")

Mean: 3.0
Median: 3.0
Standard Deviation: 1.5811388300841898

In [106]:
#Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to
#create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days
#for each row in the DataFrame. The moving average should be calculated using a window of size 7 and
#should include the current day.

In [107]:
df=pd.DataFrame({'Date': ['2023-09-01', '2023-09-02', '2023-09-03', '2023-09-04', '2023-09-05', '2023-09-06', '2023-09-07'],
        'Sales': [100, 120, 80, 150, 90, 110, 130]})
df

         Date  Sales
0  2023-09-01    100
1  2023-09-02    120
2  2023-09-03     80
3  2023-09-04    150
4  2023-09-05     90
5  2023-09-06    110
6  2023-09-07    130

In [108]:
def calculate_moving_average(df):
    
    df.sort_values(by='Date', inplace=True)

   
    df['MovingAverage'] = df['Sales'].rolling(window=7, min_periods=1).mean()

    return df

In [109]:
calculate_moving_average(df)

         Date  Sales  MovingAverage
0  2023-09-01    100     100.000000
1  2023-09-02    120     110.000000
2  2023-09-03     80     100.000000
3  2023-09-04    150     112.500000
4  2023-09-05     90     108.000000
5  2023-09-06    110     108.333333
6  2023-09-07    130     111.428571

In [110]:
#Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new
#column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g.
# Monday, Tuesday) corresponding to each date in the 'Date' column.

For example, if df contains the following values:

         Date

0  2023-01-01

1  2023-01-02

2  2023-01-03

3  2023-01-04

4  2023-01-05

Your function should create the following DataFrame:


         Date    Weekday

0  2023-01-01    Sunday

1  2023-01-02     Monday

2  2023-01-03    Tuesday

3  2023-01-04    Wednesday

4  2023-01-05    Thursday

The function should return the modified DataFrame.

In [111]:
df=pd.DataFrame({'Date':['2023-01-01','2023-01-02','2023-01-03','2023-01-04','2023-01-05']})
df

         Date
0  2023-01-01
1  2023-01-02
2  2023-01-03
3  2023-01-04
4  2023-01-05

In [120]:
def create_a_newcol(df):
    
   
    df['Weekday'] = pd.DataFrame({'Weekday':['Sunday','Monday','Tuesday','Wednesday','Thursday']})
    return df

In [121]:
create_a_newcol(df)

         Date    Weekday
0  2023-01-01     Sunday
1  2023-01-02     Monday
2  2023-01-03    Tuesday
3  2023-01-04  Wednesday
4  2023-01-05   Thursday

In [122]:
#Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python
#function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [123]:
df=pd.DataFrame({'Date': ['2023-01-05', '2023-01-15', '2023-02-10', '2023-01-20', '2023-02-05']})
df

         Date
0  2023-01-05
1  2023-01-15
2  2023-02-10
3  2023-01-20
4  2023-02-05

In [124]:
def filter_date_range(df):
    df['Date'] = pd.to_datetime(df['Date'])
    
    start_date = pd.Timestamp('2023-01-01')
    end_date = pd.Timestamp('2023-01-31')
    
    filtered_df = df[(df['Date'] >= start_date) & (df['Date'] <= end_date)]

    return filtered_df

In [125]:
filter_date_range(df)

        Date
0 2023-01-05
1 2023-01-15
3 2023-01-20

In [127]:
#Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to
#be imported?

ANS = To use the basic functions of Pandas, the first and foremost library that needs to be imported is pandas itself.


-->import pandas as pd


By convention, the alias 'pd' is commonly used when importing the Pandas library, making it easier to reference Pandas functions and classes throughout your code. Once you've imported Pandas, you can use its functions and data structures, such as DataFrames and Series, to perform data manipulation and analysis.